# Итоговая проверочная работа

**Задача:** 
Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

**Примеры:** <br>
["hello", "2", "world", ":-)"] -> ["2", ":-)"]<br>
["1234", "1567", "-2", "computer science"] -> ["-2"]<br>
["Russia", "Danemark", "Kazan"] ->[]

**Подзадачи:**<br>
1. Создать репозиторий ни GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете ее в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим проектом (не должно быть так, что все залито одним коммитом, как минимум этапы 2, 3 и 4 должны быть расположены в разных коммитах)

**Решение**
Так как до этого момента мы изучали C#, решение будет на нем.
Я решил оформить результат задачи, получая массив при вводе с клавиатуры.
Для этого у пользователя запрашиваем длину массива, а затем в цикле запрашиваем элементы массива.
После этого выводим массив в консоль. 
Затем сравниваем в цикле длину каждого элемента массива сравниваем с условием задачи, и если условие удовлетворяет, 
то выводим новый массив в консоль.


Console.Clear();
Console.WriteLine("Введите количество элементов массива:");
int length = Convert.ToInt32(Console.ReadLine());

string[] massive = new string[length]; //объявляем массив строк длиной length, которую ввел пользователь
for (int i = 0; i < length; i++)
{
    Console.Write("Введите строку № {0}:\r\n ", i + 1);
    massive[i] = Console.ReadLine(); //Заполняем массив
}
Console.WriteLine();
Console.WriteLine("Мы получили такой массив:");
Console.Write("[");
for (int i = 0; i < length; i++)
{
    Console.Write(massive[i]); //выводим массив на экран
    if (i < length - 1)
    {
        Console.Write(" "); //делаем красивый вывод массива
    }
}
Console.Write("]");
Console.WriteLine();
Console.WriteLine("Массив, в котором длина символов не превышает 3:");
Console.Write("[");
for (int i = 0; i < length; i++)
{
    if (massive[i].Length <= 3)
    {
        Console.Write(massive[i]); //ищем индексы, удовлетворяющие условию задачи (длина символов меньше или равно 3)
        //и выводим на экран
        if (i < length - 1)
        {
            Console.Write(" "); //делаем красивый вывод массива
        }
    }
}
Console.Write("]");
Console.WriteLine();
Console.Write("Нажмите [Enter] для выхода...");
Console.ReadLine();