// Задание 3 (тайминг 25 минут)
// 1. С помощью цикла for выведите в консоль числа от 11 до 33.
for(let i=11; i <= 33; i++) {
    console.log(i);
}


// 2. С помощью цикла for выведите в консоль нечетные числа в
// промежутке от 1 до 99.
for (let i = 1; i <= 99; i+=2) {
    console.log(i);
}


// 3. С помощью цикла for выведите в консоль числа от 100 до 0.
for (let i = 100; i >= 0; i--) {
    console.log(i);
}


// 4. Дано число num с неким начальным значением. Умножайте его на 3
// столько раз, пока результат умножения не станет больше 1000.
// Какое число получится? Посчитайте количество итераций,
// необходимых для этого.
let num = 1;
let count = 0;
while(num <= 1000) {
    num *= 3;
    count++;
}
console.log(`Результат: ${num}`);
console.log(`Количество итераций: ${+ count}`);
